&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДатаВремя = Параметры.ДатаВремя;
	Час = Час(ДатаВремя);
	Минут = Минута(ДатаВремя);
	Если Минут < 15 Тогда
		Минут = 0;
	ИначеЕсли Минут < 30 Тогда
		Минут = 15;	
	ИначеЕсли Минут < 45 Тогда
		Минут = 30;	
	ИначеЕсли Минут < 59 Тогда
		Минут = 45;		
	КонецЕсли;
	
	Датавремя = НачалоДня(ДатаВремя) + Час * 3600 + Минут * 60;
	
КонецПроцедуры

&НаКлиенте
Процедура ЧасМинутыПриИзменении(Элемент)	
	Датавремя = НачалоДня(ДатаВремя) + Час * 3600 + Минут * 60;
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	Закрыть(ДатаВремя);
КонецПроцедуры

