
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
	
		Объект.Дата = НачалоДня(ТекущаяДата());	
	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура HttpRefОткрытие(Элемент, СтандартнаяОбработка)
	ПерейтиПоНавигационнойСсылке(Объект.HttpRef);
КонецПроцедуры

&НаКлиенте
Процедура КодПриИзменении(Элемент)
	
	ЗаполнитьПолноеНаименование()

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПолноеНаименование()

	Объект.ПолноеНаименование = Объект.Код + " - " + Объект.Наименование;
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	ЗаполнитьПолноеНаименование();

КонецПроцедуры
