
Процедура ПередЗаписью(Отказ)
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ЭтоНовый",Ложь);
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Ссылка) Тогда
		ЭтотОбъект.ДополнительныеСвойства.Вставить("ЭтоНовый",Истина);
	КонецЕсли;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ЭтотОбъект.ДополнительныеСвойства.ЭтоНовый Тогда
		НовыйСтатусЗадачи = РегистрыСведений.СтатусыЗадач.СоздатьМенеджерЗаписи();
		НовыйСтатусЗадачи.Задача = Ссылка;
		НовыйСтатусЗадачи.Статус = Перечисления.СтатусыЗадач.Запланирована;
		НовыйСтатусЗадачи.Период = ТекущаяДата();
		НовыйСтатусЗадачи.Записать();
	КонецЕсли;
	
КонецПроцедуры


